select 
t1.数据日期,
t1.客户端类型,
t1.分类 as '标签',
t1.渠道,
t1.组别 as '一级分类',
t2.二级分类,
t2.三级分类,
t1.任务下发时间,
t1.专题名称,
t1.子策划编码,
t1.短信内容,
t1.目标群体,
max(t1.标签圈定量) as `标签圈定量`,
max(t1.标签圈定量（实际目标）) as `标签圈定量（实际目标）`,
max(t1.去重后人群数量)  as `去重后人群数量`,
max(t1.成功发送用户数) as `成功发送用户数`,
sum(t1.手机号码进端量)  as `手机号码进端量`,
sum(t1.手机号码拉新量) as `手机号码拉新量`,
sum(t1.页面PV)as `页面PV`,
sum(t1.页面UV)as `页面UV`,
ROUND((max(t1.标签圈定量（实际目标）)-max(t1.去重后人群数量))/max(t1.标签圈定量（实际目标）),8) as `去重率`,
ROUND((max(t1.成功发送用户数)/max(t1.t1.去重后人群数量)),8) as `成功下发率`,
ROUND((sum(t1.手机号码进端量)/max(t1.成功发送用户数)),8) as `进端率`,
ROUND((sum(t1.手机号码拉新量)/max(t1.成功发送用户数)),8) as `拉新率`,
ROUND((sum(t1.页面UV)/max(t1.成功发送用户数)),8) as `打开率`,
t3.手机号码进端新增用户次日留存率 as `次日留存率`,
t2.是否优势项目,
t2.客群身份,
t2.时效 as `时效类别`,
t2.页面类别,
t2.阶段 as `活动阶段`,
case when t2.是否智能推荐 = '是' then '智能推荐' else t2.是否智能推荐 end as '功能插件',
t1.活动持续天数,
t1.月份,
t1.日
from
(select 
明细报表.数据日期 ,
明细报表.客户端类型 ,
明细报表.组别,  
明细报表.任务下发时间 ,  
明细报表.专题名称 ,
明细报表.页面ID ,
明细报表.子策划编码 ,
datediff(明细报表.数据日期,明细报表.任务下发时间)+1 as `date`,
case when 明细报表.渠道='IOP' then 'IOP短信' else 明细报表.渠道 end as '渠道',
明细报表.短信内容 ,
明细报表.目标群体 ,
明细报表.标签圈定量,
明细报表.标签圈定量（实际目标）,
明细报表.去重后人群数量 ,
明细报表.成功发送用户数,
明细报表.手机号码进端量,
明细报表.手机号码拉新量 ,
明细报表.页面PV,
明细报表.页面UV,
明细报表.分类,
datediff(明细报表.数据日期,明细报表.任务下发时间)+1 as `活动持续天数`,
case when 明细报表.数据日期 then concat(month(明细报表.数据日期),'月') else null end 月份,
day(明细报表.数据日期) as 日
 from `明细报表`
where 明细报表.公司 = '亚信'    
) t1
left join 
(select 
子策划编码,
二级分类,
三级分类,
省份,
是否体育大省,
项目,
是否优势项目,
客群年龄,
是否重点客群,
客群身份,
会员性别,
竞品,
时效,
页面类别,
覆盖次数,
客群分层,
阶段,
是否智能推荐,
`是否热点+时效`,
世界杯用户分层策略
 from `冬奥期间活动表格` 
)t2
on t1.子策划编码 = t2.子策划编码
left join 运营指标监控报表 t3
on t1.子策划编码 = t3.子策划编码 and t1.数据日期 = t3.数据日期
where t1.客户端类型 = '咪咕音乐'
and t1.数据日期 >= '2023-08-01'
group by left (t1.数据日期,10),left (t1.任务下发时间,10),left (t1.子策划编码,21)