select 
t1.子策划编码,
t1.客户端类型,
t1.分类 as '标签',
t1.渠道,
t1.组别 as '一级分类',
t2.二级分类,
t2.三级分类,
t1.任务下发时间,
t1.专题名称,
t1.短信内容,
t1.目标群体,
max(t1.标签圈定量) as `标签圈定量`,
max(t1.标签圈定量（实际目标）) as `标签圈定量（实际目标）`,
max(t1.去重后人群数量)  as `去重后人群数量`,
max(t1.成功发送用户数) as `成功发送用户数`,
max(t9.手机号码累计进端量)  as `进端量`,
sum(t1.手机号码拉新量) as `拉新量`,
sum(t1.页面PV)as `页面PV`,
sum(t1.页面UV)as `页面UV`,
ROUND((max(t1.标签圈定量（实际目标）)-max(t1.去重后人群数量))/max(t1.标签圈定量（实际目标）),8) as `去重率`,
ROUND((max(t1.成功发送用户数)/max(t1.t1.去重后人群数量)),8) as `成功下发率`,
ROUND((max(t9.手机号码累计进端量)/max(t1.成功发送用户数)),8) as `进端率`,
ROUND((sum(t1.手机号码拉新量)/max(t1.成功发送用户数)),8) as `拉新率`,
ROUND((sum(t1.页面UV)/max(t1.成功发送用户数)),8) as `打开率`,
t6.拉新量 as `1日拉新量`,
t4.拉新量 as `3日拉新量`,
t8.拉新量 as `7日拉新量`,
t6.UV as `1日UV`,
t4.UV as `3日UV`,
t8.UV as `7日UV`,
ROUND((t6.拉新量/max(t1.成功发送用户数)),8) as `1日拉新率`,
ROUND((t4.拉新量/max(t1.成功发送用户数)),8) as `3日拉新率`,
ROUND((t8.拉新量/max(t1.成功发送用户数)),8) as `7日拉新率`,
ROUND((t6.UV/max(t1.成功发送用户数)),8) as `1日打开率`,
ROUND((t4.UV/max(t1.成功发送用户数)),8) as `3日打开率`,
ROUND((t8.UV/max(t1.成功发送用户数)),8) as `7日打开率`,
t2.是否优势项目,
t2.客群身份,
t2.时效 as `时效类别`,
t2.页面类别,
t2.阶段 as `活动阶段`,
case when t2.是否智能推荐 = '是' then '智能推荐' else t2.是否智能推荐 end as '功能插件',
t2.智能推荐内容分类
from
(select 
明细报表.客户端类型 ,
case when 明细报表.组别='体育组' then '体育' else 明细报表.组别 end as '组别' ,  
明细报表.任务下发时间 , 
明细报表.数据日期 , 
明细报表.专题名称 ,
明细报表.页面ID ,
明细报表.子策划编码 ,
CASE WHEN 明细报表.专题名称 like '%潜客%' then '潜客模型' else '(空白)' end as  '潜客模型',
datediff(明细报表.数据日期,明细报表.任务下发时间)+1 as `date`,
case when 明细报表.渠道='IOP' then 'IOP短信' else 明细报表.渠道 end as '渠道', 
明细报表.短信内容 ,
明细报表.目标群体 ,
明细报表.标签圈定量,
明细报表.标签圈定量（实际目标）,
明细报表.去重后人群数量 ,
明细报表.成功发送用户数,
明细报表.手机号码进端量,
明细报表.手机号码拉新量 ,
明细报表.页面PV,
明细报表.页面UV,
明细报表.分类
 from `明细报表`
where 明细报表.任务下发时间 >= '2023-08-01'
and 明细报表.公司 = '亚信'    
) t1
left join 
(select 
子策划编码,
二级分类,
三级分类,
省份,
是否体育大省,
项目,
是否优势项目,
客群年龄,
是否重点客群,
客群身份,
会员性别,
竞品,
时效,
页面类别,
覆盖次数,
客群分层,
阶段,
是否智能推荐,
`是否热点+时效`,
世界杯用户分层策略,
智能推荐内容分类
 from `冬奥期间活动表格`
)t2
on t1.子策划编码 = t2.子策划编码
left join
(select
t3.数据日期 , 
t3.任务下发时间 , 
t3.子策划编码,
t3.date,
sum(t3.手机号码拉新量) as `拉新量`,
sum(t3.页面UV) as `UV`
from
(select 
明细报表.客户端类型 , 
明细报表.任务下发时间 , 
明细报表.数据日期 , 
明细报表.子策划编码 ,
datediff(明细报表.数据日期,明细报表.任务下发时间)+1 as `date`,
明细报表.手机号码拉新量 ,
明细报表.页面UV
 from `明细报表`
where 明细报表.任务下发时间 >= '2023-08-01'
and 明细报表.公司 = '亚信'  
and 明细报表.客户端类型 = '咪咕音乐'  
)t3
where t3.date <= 3
group by t3.子策划编码
)t4
on t1.子策划编码 = t4.子策划编码 
left join
(select
t5.数据日期 , 
t5.任务下发时间 , 
t5.子策划编码,
t5.date,
sum(t5.手机号码拉新量) as `拉新量`,
sum(t5.页面UV) as `UV`
from
(select 
明细报表.客户端类型 , 
明细报表.任务下发时间 , 
明细报表.数据日期 , 
明细报表.子策划编码 ,
datediff(明细报表.数据日期,明细报表.任务下发时间)+1 as `date`,
明细报表.手机号码拉新量 ,
明细报表.页面UV
 from `明细报表`
where 明细报表.任务下发时间 >= '2023-08-01'
and 明细报表.公司 = '亚信'  
and 明细报表.客户端类型 = '咪咕音乐'  
)t5
where t5.date <= 1
group by t5.子策划编码
)t6
on t1.子策划编码 = t6.子策划编码 
left join
(select
t7.数据日期 , 
t7.任务下发时间 , 
t7.子策划编码,
t7.date,
sum(t7.手机号码拉新量) as `拉新量`,
sum(t7.页面UV) as `UV`
from
(select 
明细报表.客户端类型 , 
明细报表.任务下发时间 , 
明细报表.数据日期 , 
明细报表.子策划编码 ,
datediff(明细报表.数据日期,明细报表.任务下发时间)+1 as `date`,
明细报表.手机号码拉新量 ,
明细报表.页面UV
 from `明细报表`
where 明细报表.任务下发时间 >= '2023-08-01'
and 明细报表.公司 = '亚信'  
and 明细报表.客户端类型 = '咪咕音乐'  
)t7
where t7.date <= 7
group by t7.子策划编码
)t8
on t1.子策划编码 = t8.子策划编码
left join 
(select 子策划编码, 手机号码累计进端量 from 基于mgba指标数据累计报表
group by 子策划编码) t9
on t1.子策划编码 = t9.子策划编码
where t1.客户端类型 = '咪咕音乐'
group by left (t1.任务下发时间,10),left (t1.子策划编码,21)